{"idx": "1", "title": "Word Brain Teasers", "rule_content": "1.A series of words will be given in the question.\n2.These words have one thing in common, usually the same prefix of a suffix or the same combination of letters.\n3.This commonality will be given in the question.\n4.You need to answer which words or letter combinations are common to each of these words. e.g. If each of these words contains the name of an animal, the answer needs to be the name of the animal contained in each word in turn.", "tag": "riddle"}
{"idx": "2", "title": "Word Roots and Affixes", "rule_content": "1.Given a set of letter combinations.\n2.Add the same prefix or suffix before or after the letter combinations to form meaningful words.\n3.Output is the prefix or suffix.", "tag": "riddle"}
{"idx": "3", "title": "Connect words", "rule_content": "1.The puzzle gives a set of letters and the number and length of words to be spelled, e.g. 2 words: 2 letters, 3 letters, 3 letters.\n2.The player has to use the given letters to spell a word of the required length and number of letters.\n3.Each letter can be used at most once in a word.", "tag": "riddle"}
{"idx": "4", "title": "Anagram", "rule_content": "1.Begin by giving a word or phrase.\n2.Rearrange the letters to form one or more new words or phrases using all or some of the letters (e.g.four of the five letters).\n3.Questions will indicate the requirement for the number of letters to be used.\n4.The newly formed word or phrase must be a valid word or phrase and the answer should cite all the newly formed words.", "tag": "riddle"}
{"idx": "5", "title": "Crypto-Math", "rule_content": "1.The game gives a formula of letters, each representing a unique number (0-9). \n2.Different letters cannot represent the same number.\n3.The first letter of any multi-digit number cannot represent 0.Please output the answer in the format of [[the_original_formula]]", "tag": "riddle"}
{"idx": "6", "title": "Word ladder", "rule_content": "1.The game starts with a word and specifies an ending word.\n2.Only one letter can be changed at a time, and each intermediate step must be a valid word.\n3.Change from the start word to the end word by the fewest steps.\n4.The question will give the start and end words, answer the minimum number of steps needed to change from the start word to the end word.", "tag": "riddle"}
{"idx": "7", "title": "Logic puzzle", "rule_content": "1.Each puzzle contains a number of elements and attributes, and a description of them.\n2.The descriptions are usually presented in the form of clues, each of which provides part of the information, and all of which are true and do not contradict each other.\n3.The information provided by the clues needs to be combined and analyzed to match elements to attributes.", "tag": "riddle"}
{"idx": "8", "title": "Word Search", "rule_content": "1.The game is played on a square grid of letters.\n2.The player is given a set of words to find on the grid.\n3.The words can be arranged horizontally, vertically, diagonally, backwards or staggered.\n4.Find all hidden words with at least 5 letters and answer them one by one in capital letters. e.g. [[APPLE, BANANA, ORANGE, ...]]", "tag": "riddle"}
{"idx": "9", "title": "Math Path", "rule_content": "1.Give a set of operation symbols.\n2.Find the correct number from numbers 0 through 9 to make the equation equal to the given number.\n3.Follow the normal order of operations.", "tag": "math"}
{"idx": "10", "title": "24 points", "rule_content": "1.Randomly select four numbers from 1-13, the numbers can have repetition.\n2.Using the four basic operation symbols of addition (+), subtraction (-), multiplication (*), and division (÷).\n3.Can also use parentheses to change the order of operations.\n4.The result is equal to 24.\n5.Each number must be used and can be used only once.", "tag": "math"}
{"idx": "11", "title": "Survo", "rule_content": "1.A rectangular grid is given, which is pre-filled with numbers, while each row and column has a number at the end indicating the sum of the numbers in that row or column.\n2.The player needs to fill the remaining spaces with a specified set of numbers. \n3.Each number can only be used once.\n4.The numbers must be filled in such that the sum of the numbers in each row and column matches the intended sum.\n5.The puzzle is given in the form of a matrix with blank squares filled with X and the player replaces the squares with numbers.", "tag": "math"}
{"idx": "12", "title": "kukurasu", "rule_content": "1.A rectangular grid is given with a number at the end of each row and column indicating the sum of the weights of the filled black cells in that row or column.\n2.In column i, the weight of the black grid is equal to its position in that column (i.e., 1 through n). Similarly, the weight of the black grid in row j is equal to its position in that row (i.e. 1 through n).\n3.The player needs to blacken a number of cells in the grid such that the sum of the weights of the black cells in each row and column is equal to the given numbers.\n4.The problem is given by a matrix in the form of a blank grid filled with X. Below and to the right of the matrix are attached the numerical constraints mentioned above. The player replaces the grid to be blacked out with 1.", "tag": "math"}
{"idx": "13", "title": "Numbrix", "rule_content": "1.The puzzle is played on an n*n grid and the numbers 1 to 81 should appear only once in the grid.\n2.The numbers must be arranged in order, i.e. 1 next to 2, 2 next to 3, and so on, up to 81.\n3.The numbers can be arranged horizontally or vertically, but not diagonally.\n4.The problem is given in the form of a matrix, with blank squares filled with X's, and the player squares replaced with numbers.", "tag": "math"}
{"idx": "14", "title": "Number Wall", "rule_content": "1.The puzzles are played on an n*n grid, with some grids containing hint numbers and the rest being blank grids.\n2.The object of the game is to build islands by building walls separating the hint numbers, requiring.\n3.Each island contains only one hint number.\n4.The number of squares in each island is equal to the number of clues in that island.\n5.Islands are separated from each other vertically or horizontally.\n6.There are no 2x2 or larger rectangles in the area formed by the wall.\n7.Walls can form a continuous path.\n8.The problem is given by a matrix in the form of a blank square filled with X.The player should replace the grid on which the wall is built with A and output the drawn matrix, which contains X (the blank island), A (the wall) and the numbers.", "tag": "math,space"}
{"idx": "15", "title": "Sudoko", "rule_content": "1.The game consists of a 9x9 grid which is subdivided into nine 3x3 subgrids.\n2.The grid is pre-filled with numbers which act as hints to help the player solve the sudoku.\n3.The player needs to fill the entire grid so that each row, column and 3x3 subgrid contains all the numbers from 1 to 9 without repetition.\n4.The puzzle is given in the form of a matrix with blank squares filled with X, and the player should replace these areas with numbers.", "tag": "math,space"}
{"idx": "16", "title": "Calcudoko", "rule_content": "KenKen is a puzzle where you fill a grid with digits (1 through N for an NxN grid) so that:\n1. Each row and column contains each digit exactly once (Latin square)\n2. Cages (outlined groups of cells) must satisfy the target number using the specified operation (+,-,*,/)\n3. For single-cell cages, just place the target number\n4. Letters (A,B,C...) represent different cages, with constraints listed below each puzzle\nPlease answer in the format [[1, 2, 3, 1, 2, 3, ...]] that directly combine all rows of the solution grid into a single row, with no special characters between rows.", "tag": "math,space"}
{"idx": "17", "title": "Futoshiki", "rule_content": "Puzzle Format:\n- '_' represents an empty cell to be filled\n- Numbers (if present) are pre-filled cells\n- The lines between rows show the vertical constraints\n- Each puzzle has exactly one solution\n- Answer in format [[1, 2, 3, 4, 5, 2, 1, ...]] from first row to last row without any special characters between rows.", "tag": "math,space"}
{"idx": "18", "title": "Vector puzzles", "rule_content": "1.The game is played on an n*n grid containing numbered and blank squares.\n2.Arrows are drawn by players.\n3.Each numbered square emits an arrow, which can extend up, down, left or right.\n4.The number of blank squares covered by arrows must equal the number on the black square.\n5.Arrows cannot pass through or cross other arrows.\n6.Each blank square must be covered by at least one arrow.\n7.The question is given by a matrix of blank squares filled with X. The player should replace these regions with the four arrows ↓ ↑ → ← and output the drawn matrix.", "tag": "space"}
{"idx": "19", "title": "Star battle", "rule_content": "1.The game is played on a grid consisting of several partitions (zones). Each partition consists of a number of squares.\n2.Place stars in the given grid.\n3.n stars are placed in each row and column.\n4.n stars are placed in each partition.\n5.Stars cannot be adjacent, i.e., there can be no stars in adjacent squares (including diagonally adjacent).\n6.The question is given in the form of a matrix with different regions labeled with different letters, e.g. the grid where all the letters A are located forms a region and the answer should list the coordinates of the stars in each region, e.g. A:(row i, column j)", "tag": "space"}
{"idx": "20", "title": "Campsite", "rule_content": "1.The game is played on an n*m grid with trees at some locations in the grid.\n2.To place tents on the grid.\n3.Each tent must be orthogonally adjacent to a tree (i.e., above, below, to the left, or to the right of the tree).\n4.Tents cannot be orthogonally or diagonally adjacent to other tents.\n5.Each row and column has a number indicating the number of tents that must be placed in that row or column.\n6.Each puzzle has and has only one unique solution.\n7.The puzzle is given by a matrix in the form of T, which represents the position of the tree, and X, which represents the spaces,To the right and below the matrix are numerical constraints, and you need to replace X with C (for tents) for some spaces, and the answer is a matrix.", "tag": "space"}
{"idx": "21", "title": "Minesweeper", "rule_content": "1.The game is played on an n*n grid, under each of which a mine may be hidden or empty.\n2.Some squares show a number indicating the number of mines around them (8 squares including the diagonal).\n3.Our puzzle uses X to fill the squares without numbers.\n4.The player needs to find all the squares where mines are located and replace X with A.", "tag": "space"}
{"idx": "22", "title": "Arrow Maze", "rule_content": "1.The maze consists of a grid with an arrow in each grid cell pointing in one of eight directions up, down, left, right, or diagonally.\n2.The maze has a well-defined start and end point.\n3.The player starts at the starting point, moves to the next grid cell in the direction indicated by the arrow, and then continues to move as indicated by the arrow in the new grid.\n4.The player must move strictly in the direction indicated by the arrows and cannot go in the opposite direction or choose another path.\n5.The game is won when the player successfully reaches the end from the starting point.", "tag": "space"}
{"idx": "23", "title": "Norinori", "rule_content": "1.The puzzle is played on an N*N grid, which is divided into regions.\n2.The player must place dominoes on some of the cells so that.\n3.There are exactly 2 cells in each region that are covered by dominoes.\n4.Each shaded cell should be part of a domino*. Dominoes can cross region boundaries.\n5.Dominoes cannot touch each other, except diagonally.\n6.Dominoes are shapes (1x2 or 2x1) consisting of two adjacent shaded cells.\n7.The question is given in matrix form, with different letters representing different regions.", "tag": "space"}
{"idx": "24", "title": "Wordscapes", "rule_content": "1.The puzzles are played on a grid and the questions are given in the form of a matrix, consisting of X and 0.\n2.The player needs to replace X for filling in d letters and 0 for separating words that cannot be filled in with letters.\n3.Two lists of words are given, across and down. Across means fill in the words from left to right, and down means fill in the words from top to bottom.\n4.During the game, many words will cross each other and share some letters.The letters that cross must match.\n5.The question consists of a list of words and a matrix, where X denotes a grid to be filled with letters and 0 denotes a grid that does not need to be filled with letters,e.g.\nX X X\n0 X 0\n0 X 0", "tag": "riddle,space"}
{"idx": "25", "title": "Skyscrapers", "rule_content": "1.The game is played on an n*n grid, with skyscrapers placed in all cells on the grid.\n2.Skyscrapers have a height of 1 to the size of the grid, i.e. 1 to 4 for a 4x4 puzzle.\n3.You cannot have two skyscrapers of the same height in the same row or column.\n4.The numbers on the sides of the boxes indicate how many skyscrapers you would see if you looked in the direction of the arrows, since taller buildings will be blocked by shorter ones.\n5.Fill in the numbers in each cell to indicate the height of the skyscrapers.\n6.The topic consists of an n*n matrix filled with X, with the numerical constraints mentioned above attached to the top and bottom.", "tag": "math,space"}
